{
    "data":[
        {
            "id":"pokefactory",
            "title" : "pokefactory",
            "colSpan": "lg:col-span-2",
            "rowSpan": "lg:row-span-1",
            "image": "/image/pokefactory/pokefactory-banner.png",
            "ogimage": "/image/pokefactory/og-pokefactory-banner.png",
            "githubLink": "",
            "description" : "petit projet de jeu video fait avec unity en solo, j'avais envie de faire un petit jeu video de gestion dans l'univers de pokemon",
            "tag": "jeu-video",
            "icons" : ["unity", "csharp"],
            "date": 2023,
            "ps": "ce projet est encore en construction, promis je mets a jour la page quand j'ai fini 👷 ",
            "projectinfos": [
                {
                    "image": "/image/pokefactory/image-1.png",
                    "title": "L'idee",
                    "description": "faire un fan-game de pokemon mais plutot dans le style d'un jeu de gestion a la game dev tycoon."
                },{
                    "image": "/image/pokefactory/image-2.png",
                    "title": "Construction",
                    "gifImage" : "/image/pokefactory/image-2-gif.gif",
                    "description": "l'une des feature principale, etait la construction de batiment au sein du jeu."
                },{
                    "image": "/image/pokefactory/image-3.png",
                    "gifImage" : "/image/pokefactory/image-3-gif.gif",
                    "title": "Recrutement",
                    "description": "pouvoir recruter des scientifiques etait aussi une feature principale, car cela permettra au joueur de fabriquer des pokeballs."
                },{
                    "image": "/image/pokefactory/image-4.png",
                    "gifImage" : "/image/pokefactory/image-4-gif.gif",
                    "title": "Pokeball",
                    "description": "et donc, la fabrication et la personnalisation de pokeball a aussi ete un element du gameplay a travaille."
                },{
                    "image": "/image/pokefactory/image-5.png",
                    "gifImage" : "/image/pokefactory/image-5-gif.gif",
                    "title": "Pathfinding",
                    "description": "il y aussi du pathfinding (a*) pour que les petits personnages puissent utiliser les batiments."
                }
            ]
        },
        {
            "id":"galaktoon",
            "title" : "galaktoon",
            "colSpan": "lg:col-span-2",
            "rowSpan": "lg:row-span-2",
            "image": "/image/galaktoon/galaktoon.png",
            "ogimage": "/image/galaktoon/og-galaktoon.png",
            "tag": "jeu-video",
            "githubLink": "",
            "description" : "Projet final de ma premiere annee d'etudes a l'ecole by cci campus gobelin en groupe avec 3 designers graphiques",
            "icons" : ["javascript", "p5js", "electron"],
            "date": 2023,
            "projectinfos": [
                {
                    "image": "/image/galaktoon/galaktoon-1.png",
                    "title": "Le projet",
                    "description": "projet final de ma premiere annee d'etudes dans le domaine du developpement web, le but etait de creer un jeu video 2D en utilisant simplement la bibliotheque p5.js (sans manipuler le DOM)"
                },{
                    "image": "/image/galaktoon/galaktoon-2.png",
                    "title": "L'histoire",
                    "description": "pour presenter au mieux l'histoire, l'affichage de petit bande dessinees a ete developpe"
                },{
                    "image": "/image/galaktoon/galaktoon-3.png",
                    "title": "Les dialogues",
                    "description": "afin de pouvoir interagir avec les 'pnj' et de mieux comprendre l'histoire, un systeme de dialogue a ete mis en place"
                },{
                    "image": "/image/galaktoon/galaktoon-4.png",
                    "title": "Le deplacement et la carte",
                    "description": "dans ce jeu en vue du dessus, il est possible de se deplacer et de changer de 'map' pour pouvoir se balader dans le jeu"
                },{
                    "image": "/image/galaktoon/galaktoon-5.png",
                    "title": "Le combat",
                    "description": "le combat se fait au tour par tour avec des cartes, un peu a la maniere de Dofus, le joueur lance des sorts avec des cartes lorsqu'il est a portee de l'ennemi"
                },{
                    "image": "/image/galaktoon/galaktoon-6.png",
                    "title": "Le vaisseau",
                    "description": "le vaisseau est l'endroit ou commence le joueur qui incarne dans l'histoire le personnage de Void, un etre synthetique qui ne sait rien de ses origines"
                },{
                    "image": "/image/galaktoon/galaktoon-7.png",
                    "title": "Les quetes",
                    "description": "afin de suivre l'histoire au mieux a travers des objectifs, le systeme de quete a ete mis en place"
                },{
                    "image": "/image/galaktoon/galaktoon-8.png",
                    "title": "Le lit",
                    "description": "lorsque le joueur perd de la vie, il peut simplement la regagner en utilisant le lit"
                },{
                    "image": "/image/galaktoon/galaktoon-9.png",
                    "title": "L'antre de Dark Woaf",
                    "description": "l'antre de Dark Woaf est la carte final ou va se derouler le combat final contre le plus grand tyran de la galaxie Dark Woaf."
                },{
                    "image": "/image/galaktoon/galaktoon-10.png",
                    "title": "L'outil de creation de map'",
                    "description": "pour assurer un bon workflow avec mes designers, un outil de creation de map a ete fait, toujours en utilisant p5.js mais cette fois ci avec une couche de Electron pour en faire un petit soft"
                },{
                    "image": "/image/galaktoon/galaktoon-11.png",
                    "title": "Outil d'ajout de tuiles",
                    "description": "pour pouvoir importer les assets graphiques, il y a un petit onglet import tile pour pouvoir importer une 'tuile' de map qui va permettre a l'utilisateur de composer la map"
                },{
                    "image": "/image/galaktoon/galaktoon-12.png",
                    "title": "L'export de map",
                    "description": "l'export de map suit la structure que j'ai utilise pour les cartes du jeu video, les designers n'ont plus qu'a m'envoyer le dossier ou se trouve le fichier json et je m'occupe du reste"
                }
            ]
        },
        {
            "id":"thefallennecromancer",
            "title" : "the fallen necromancer",
            "colSpan": "lg:col-span-1" ,
            "rowSpan": "lg:row-span-1",
            "image": "/image/fallen_necromancer/thumbnail-necro.png",
            "ogimage": "/image/fallen_necromancer/og-thumbnail-necro.png",
            "tag": "jeu-video",
            "githubLink": "",
            "description" : "premier projet de jeu video, j'etais un grand lecteur d'un 'webtoon' en 2020 qui s'appelait Solo Levelling, j'avais ete completement absorbe par cette lecture que j'ai decide d'en faire un jeu autour d'un concept simple : tuer des boss afin d'en faire nos esclaves",
            "icons" : ["unity", "csharp"],
            "date": 2021,
            "projectinfos": [
                {
                    "image": "/image/fallen_necromancer/Image1.png",
                    "title": "Essence du projet",
                    "description": "ne sachant pas trop ou le jeu pouvait commencer, j'ai decide que le premier niveau serait un cimetiere car on incarne un necromancien"
                },{
                    "image": "/image/fallen_necromancer/Image3.png",
                    "title": "Assets du jeu",
                    "description": "sachant que j'avais a coeur de realiser la plupart des assets du jeu, j'ai decide d'apprendre le pixel art pour faire le personnage principal"
                },{
                    "image": "/image/fallen_necromancer/Image2.png",
                    "title": "Animation des personnages",
                    "description": "une partie complique du developpement a ete les animations, je n'avais aucune idee a ce moment de comment un jeu se developpait, mais j'avais tellement envie de realiser mon idee que j'etais pret a tout apprendre"
                },{
                    "image": "/image/fallen_necromancer/Image4.png",
                    "title": "'ChAra dEsIgn'",
                    "description": "il a aussi fallu faire des personnages annexes, ce qui m'a permit d'obtenir une vision plus graphique du developpement de mon jeu et de ne pas etre focalise sur l'aspect technique"
                },{
                    "image": "/image/fallen_necromancer/Image5.png",
                    "title": "L'Inventaire",
                    "description": "n'ayant pas de competences techniques tres pousses, developper un inventaire etait un enfer, mais a force de perseverer j'ai pu obtenir un resultat fonctionnel et 'beau' (a mes yeux)"
                },{
                    "image": "/image/fallen_necromancer/Image6.png",
                    "title": "Le Combat",
                    "description": "une partie plus plaisante du developpement etait le combat, sachant que unity mache le travail avec les blocs de collisions, j'ai pu faire face a cette problematique sans soucis"
                }
            ],
            "ps": "je n'ai que d'infimes souvenirs de ce projet et jusqu'il y a peu, c'etait un peu un lost media pour moi, je savais qu'il existait mais je n'avais plus aucune trace de lui (je ne connaissais pas github...) mais recemment, un ami qui m'avait aide pour le logo (merci matteo) m'a montre qu'il avait retrouve le projet unity sur un ancien wd portable !"
        },
        {
            "id":"osirus",
            "title" : "osirus",
            "colSpan": "lg:col-span-1" ,
            "rowSpan": "lg:row-span-1",
            "image": "/image/osirus/devlog_osirus.png",
            "ogimage": "/image/osirus/og-devlog_osirus.png",
            "tag": "web-app",
            "githubLink": "",
            "description" : "projet de reseau social 'flash' en cours de vue.js pendant mes etudes, la seule contrainte etait d'utiliser vue.js mais j'ai voulu rajouter Firebase parce que j'avais envie d'essayer l'authentification malgre mon manque d'experience, ce projet etait donc un reseau social pour que les developpeurs puissent partager uniquement des snippets de code entre eux",
            "icons" : ["vue", "firebase"],
            "date": 2022,
            "projectinfos": [
                {
                    "image": "/image/osirus/osirus-0.png",
                    "title": "L'authentification",
                    "description": "l'authentification se fait a l'aide de Firebase car ils ont une superbe API, ne m'y connaissant pas en authentification a ce moment la, j'ai pu tout de meme en mettre une en place facilement grace a la simplicite d'utilisation de l'API que proposait Google Firebase"
                },{
                    "image": "/image/osirus/osirus-1.png",
                    "title": "Les posts",
                    "description": "etant un reseau social, il y a des posts que l'on peut upvoter ou downvoter (a la maniere d'un reddit), ces posts sont aussi stocke sur Firebase et lie aux comptes des utilisateurs"
                },{
                    "image": "/image/osirus/osirus-2.png",
                    "title": "Les commentaires",
                    "description": "on peut aussi commenter les posts des autres."
                },{
                    "image": "/image/osirus/osirus-3.png",
                    "title": "Transformation du code en 'jolie' code",
                    "description": "pour les posts, je voulais que l'on puisse avoir de belles previsualisations de code sur le front mais pas que l'on poste d'image directemment, pour se faire, j'ai utilise l'api sourcecodeshots qui permet de transformer du texte en jolie image de code, et on peut choisir la couleur du fond, le langage (pour la coloration syntaxique),.."
                },{
                    "image": "/image/osirus/osirus-4.png",
                    "title": "Modification du pseudo de l'utilisateur",
                    "description": "il est aussi possible de modifier le nom d'utilisateur de son compte sur la page 'mon compte'"
                },{
                    "image": "/image/osirus/osirus-5.png",
                    "title": "Fonction de recherche",
                    "description": "pour la fonctionnalite de recherche, j'ai aussi pu la mettre facilement en place grace a Firebase"
                }
            ]
        },
        {
            "id":"dragonballomega",
            "title" : "dragon ball omega tap",
            "colSpan": "lg:col-span-4" ,
            "rowSpan": "lg:row-span-1",
            "image": "/image/dragon-ball/dragon-ball-omg.png",
            "ogimage": "/image/dragon-ball/og-dragon-ball-omg.png",
            "tag": "jeu-video",
            "githubLink": "https://ethancarollo.github.io/dragon-ball-omega-tap/",
            "description" : "petit projet de jeu video fait pendant un cours de Javascript",
            "icons" : ["javascript", "html", "css"],
            "date": 2022,
            "projectinfos": [
                {
                    "image": "/image/dragon-ball/image1.png",
                    "title": "L'idee",
                    "description": "le but etait de faire un petit jeu video en javascript, html et css pour pouvoir mettre en pratique ce que l'on avait appris durant le cours."
                },{
                    "image": "/image/dragon-ball/image3.png",
                    "title": "Le combat",
                    "description": "l'essence du jeu, le combat, pour se faire il suffit de cliquer le plus vite possible sur la touche espace afin de pouvoir terrasser l'adversaire."
                },{
                    "image": "/image/dragon-ball/image2.png",
                    "title": "Le choix du personnage",
                    "description": "il est donc possible de choisir quel personnage on souhaite jouer, cela ne change rien a la facon de jouer, c'est simplement esthetique."
                },{
                    "image": "/image/dragon-ball/image4.png",
                    "title": "Campagne",
                    "description": "il y a aussi un petit systeme de campagne qui permet de debloquer les personnages que l'on souhaite avec differents type de difficultes."
                },{
                    "image": "/image/dragon-ball/image5.png",
                    "title": "Code de triche",
                    "description": "evidemment, si vous souhaitez jouer avec des personnages mais que vous ne voulez pas faire la campagne, vous pouvez le debloquez en utilisant un code de triche (UNLOCKALL)"
                }
            ]
        },
        {
            "id":"starfoundation",
            "title" : "star foundation",
            "colSpan": "lg:col-span-2" ,
            "rowSpan": "lg:row-span-1",
            "image": "/image/star_foundation/star_foundation_logo.png",
            "ogimage": "/image/star_foundation/og-star_foundation_logo.png",
            "description" : "petit projet de jeu video textuel en groupe pendant le cours de structure de donnee de 2/3, le but etait de faire un rpg textuel en soignant la structure de donnee et en utilisant des formats de donnees vus en cours et avec le langage de programmation de notre choix. Pour ce projet, j'etais en groupe avec mon collegue Pierre Louis",
            "tag": "jeu-video",
            "githubLink": "",
            "icons" : ["ruby"],
            "date": 2023,
            "collaborators": [
                {
                    "name": "Pierre Louis",
                    "link": "https://www.pierrelouisrousseaux.fr"
                }
            ],
            "projectinfos": [
                {
                    "image": "/image/star_foundation/star-foundation-0.png",
                    "title": "L'histoire",
                    "description": "l'histoire de notre jeu etait assez simple, un brigand de l'espace qui a ete trahi par son equipage qui decide de se venger"
                },{
                    "image": "/image/star_foundation/star-foundation-5.png",
                    "title": "Pourquoi du Ruby ?",
                    "description": "pourquoi Ruby pour un projet du genre ? en soi, il n'y avait pas vraiment de raison, on voulait simplement profiter de la liberte de pouvoir choisir son langage de programmation afin d'en decouvrir un nouveau bien que ce ne soit peut etre pas la solution la plus fiable pour un rpg textuel"
                },{
                    "image": "/image/star_foundation/star-foundation-2.png",
                    "title": "Le jeu",
                    "description": "etant donc un rpg textuel, on peut choisir ses competences et les choix des evenements se font avec des lancees de dees a la facon d'un jeu de role sur table, plus le nombre est grand, plus la reussite est 'critique', plus il est petit, plus l'echec est 'critique' à son tour."
                },{
                    "image": "/image/star_foundation/star-foundation-3.png",
                    "title": "Structure de donnee",
                    "description": "pour les evenements de notre jeu, nous sommes parti sur quelque chose d'assez simple et pour le format, la contrainte etait de partir sur du json"
                },{
                    "image": "/image/star_foundation/star-foundation-4.png",
                    "title": "La sauvegarde",
                    "description": "pour la sauvegarde, la contrainte etait d'utiliser du xml"
                },{
                    "image": "/image/star_foundation/star-foundation-1.png",
                    "title": "Le recapitulatif",
                    "description": "et a la fin de l'histoire un petit recapitulatif est disponible dans un dossier du jeu au format markdown (c'etait aussi une contrainte)"
                }
            ]
        }
    ]
}